<?php

return [
    'error'          => "⚠️ برای کار با ربات ابتدا باید عضو کانال های زیر بشوید\n\nپس از تکمیل عملیات، روی دکمه \":submit\" کلیک کنید",
    'submit'         => "✅ عضو شدم",
    'submit_invalid' => "🔴 همچنان کانال هایی باقی مانده است که عضو آنها نشده اید",

    'groups' => [
        'main' => "اصلی",
    ],

    'resource' => [
        'list'                    => "لیست قفل ها:",
        'info'                    => "اطلاعات قفل:",
        'toggle_group'            => "گروه : :group",
        'info_group'              => "گروه :",
        'info_url'                => "لینک :",
        'info_title'              => "عنوان :",
        'info_expire'             => "تاریخ انقضا :",
        'info_cache'              => "کش :",
        'info_member_limit'       => "انقضا در :",
        'form_group'              => "نام گروه بندی قفل را انتخاب کنید:",
        'form_select'             => "آیدی عمومی یا عددی کانال/گروه را ارسال کنید، یا یکی از پیام های کانال را فوروارد کنید:",
        'form_select_text_error'  => "تنها آیدی عمومی و شناسه عددی قابل قبول است",
        'form_select_admin_error' => "ربات ادمین کانال نیست",
        'form_url'                => "لینک عضویت را ارسال کنید:",
        'form_url_error'          => "فرمت لینک نامناسب است",
        'form_title'              => "عنوان قفل را وارد کنید:",
        'form_cache'              => "مدت زمان کش شدن تایید ها را وارد کنید:",
        'form_member_limit'       => "زمانی که به چه تعداد اعضا رسید از لیست حذف شود؟",
    ],

    'counter' => [
        'seconds' => ":value ثانیه",
        'members' => ":value عضو",
    ],
];
